package com.work.service;

public class CenterService {

	public static void main(String[] args) {

		/**
		 * 초기 등록
		 */
		
		/**
		 * 추가등록
		 */
		
		/**
		 * 1개 제거
		 */
		
		/**
		 * 전체 제거
		 */
		
		/**
		 * 1개 변경
		 */
		
		/**
		 * 전체 조회
		 */
		
		/**
		 * 키워드로 조회
		 * 지역, 센터명, 시설명, 전화번호, 우편번호 
		 * 
		 */
		
		/**
		 * 오늘 접종자 조회(1차, 2차)
		 */
		
		/**
		 * 전체 접종자 조회(1차, 2차)
		 */
		
		/**
		 * 우선접종 대상자 식별 
		 */
		
		/**
		 * 백신별 2차 접종 대기기간 조회
		 */
	}

}
